ТОИР_демо/src/Documents/торо_ИзменениеПоложенияВСтруктуреИерархии/торо_ИзменениеПоложенияВСтруктуреИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ИзменениеПоложенияВСтруктуреИерархии</name>
  <registerRecords>InformationRegister.торо_РасположениеОРВСтруктуреИерархии</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоложенияВСтруктуреИерархии</name>
    <attributes>
      <name>ОбъектИерархии</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>РодительИерархии</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Удален</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредыдущееПоложение</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТОИР_демо/src/InformationRegisters/торо_РасположениеОРВСтруктуреИерархии/торо_РасположениеОРВСтруктуреИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РасположениеОРВСтруктуреИерархии</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РодительИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Documents/торо_ИзменениеПоложенияВСтруктуреИерархии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.торо_РасположениеОРВСтруктуреИерархии.Очистить();
	
	// регистр торо_РасположениеОРВСтруктуреИерархии
	Для Каждого ТекСтрокаПоложенияВСтруктуреИерархии Из ПоложенияВСтруктуреИерархии Цикл
		
		Если Не ТипЗнч(ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
			
			НоваяГруппаОР = Справочники.торо_ОбъектыРемонта.СоздатьГруппу();
			НоваяГруппаОР.Наименование = Строка(ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии);
			
			Попытка
				НоваяГруппаОР.Записать();
				
				СтрокаОбъектИерархии = ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии;
				
				ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии = НоваяГруппаОР.Ссылка;
				
				МассивСтрокСЭтимРодителем = ПоложенияВСтруктуреИерархии.НайтиСтроки(Новый Структура("РодительИерархии", СтрокаОбъектИерархии));
				
				Для каждого СтрокаПоложения Из МассивСтрокСЭтимРодителем Цикл
					СтрокаПоложения.РодительИерархии = ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии;
				КонецЦикла; 
				
			Исключение
				Сообщение = Новый СообщениеПользователю;
				ТекстСообщения = НСтр("ru = 'Не удалось создать группу объектов ремонта ""%ОбъектИерархии%""'");
				Сообщение.Текст = СтрЗаменить(ТекстСообщения, "%ОбъектИерархии%", ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецПопытки;
			
		КонецЕсли; 
		
		
		Движение = Движения.торо_РасположениеОРВСтруктуреИерархии.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектИерархии = ТекСтрокаПоложенияВСтруктуреИерархии.ОбъектИерархии;
		Движение.СтруктураИерархии = СтруктураИерархии;
		Движение.РодительИерархии = ТекСтрокаПоложенияВСтруктуреИерархии.РодительИерархии;
		Движение.Удален = ТекСтрокаПоложенияВСтруктуреИерархии.Удален;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#КонецЕсли
